NielsU97/ECS/software/STM32/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32L4xx_Nucleo_32/STM32L4xxNucleo32.cpp
/*!
@file
Implementatie van de c++ schil voor gebruik van de STM32412g Discovery kit.
@version $Rev: 3993 $
@author $Author: ewout $

@copyright Copyright 2017-2018 Hogeschool van Arnhem en Nijmegen, ir drs E.J Boks

$URL: http://svn.hanese.nl/docenten/svn/ewout/vakken/algemeen/software/STM32/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32L4xx_Nucleo_32/STM32L4xxNucleo32.cpp $
$Id: STM32L4xxNucleo32.cpp 3993 2020-10-01 16:24:31Z ewout $
************************************************************************/


#include <STM32L4xxNucleo32.h>
#include <algdef.h>
#include <h/STM32L4xxNucleo32.h>
#include <stm32l4xx_ll_usart.h>
#include <assert.h>


#ifndef HAL_RTC_MODULE_ENABLED
#error "HAL_RTC_MODULE_ENABLED moet aan staan voor dit BSP."
#endif

STM32L432Nucleo32::STM32L432Nucleo32(const UInt32 freq)
{
	/* STM32F4xx HAL library initialization:
       - Configure the Flash prefetch
       - Systick timer is configured by default as source of time base, but user
         can eventually implement his proper time base source (a general purpose
         timer for example or other time source), keeping in mind that Time base
         duration should be kept 1ms since PPP_TIMEOUT_VALUEs are defined and
         handled in milliseconds rtosBasisRGT.
       - Set NVIC Group Priority to 4
       - Low Level Initialization
     */
	/* Configure Flash prefetch, Instruction cache, Data cache */
#if (INSTRUCTION_CACHE_ENABLE != 0U)
	__HAL_FLASH_INSTRUCTION_CACHE_ENABLE();
#endif /* INSTRUCTION_CACHE_ENABLE */

#if (DATA_CACHE_ENABLE != 0U)
	__HAL_FLASH_DATA_CACHE_ENABLE();
#endif /* DATA_CACHE_ENABLE */

#if (PREFETCH_ENABLE != 0U)
	__HAL_FLASH_PREFETCH_BUFFER_ENABLE();
#endif /* PREFETCH_ENABLE */

	HAL_Init();
	
	/* Eerst de hal tick starten, want deze wordt gebruikt bij de opstart van de LSE klok !*/
	/* Set Interrupt Group Priority */
	HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4);
	/* Use Tim16 as time base source and configure 1ms tick (default clock after Reset is HSI) */
	HAL_InitTick(TICK_INT_PRIORITY);

//	NVIC_DisableIRQ(SysTick_IRQn);
	SYSCLKConfig_STOP(freq);
//	NVIC_EnableIRQ(SysTick_IRQn);

	/* tijdens slaap en stop moet clk voor debug blijven draaien */
#ifndef NDEBUG
	HAL_DBGMCU_EnableDBGSleepMode();
	HAL_DBGMCU_EnableDBGStandbyMode();
#endif

	/* initialiseer de peripheral drivers */
	gpioInit();
	ledsInit();

	rngInit();
	rtcInit();

	adcInit();
	dacInit();
	usart2Init();
	
	lptimInit();
	timInit();
}



TIM_HandleTypeDef STM32L432Nucleo32::Tim7Handle;

void STM32L432Nucleo32::setLED(const LEDKleur kleur,
                               const Schakelaar stand) const
{
	if(kleur < LEDKleur::LaatsteKleur) /* doe alleen de toegestane kleuren. */
	{
		static const Led_TypeDef stLEDs[1] = {LED_GREEN};

		/* Een echte lambda funktie !! */
		auto schakelFunk = [](const LEDKleur lkleur, const Schakelaar s) {
			const auto k = static_cast<Teller>(lkleur);
			switch (s)
			{
				case Schakelaar::Uit:
					BSP_LED_Off(stLEDs[k]);
					break;
				case Schakelaar::Aan:
					BSP_LED_On(stLEDs[k]);
					break;
				case Schakelaar::Om:
					BSP_LED_Toggle(stLEDs[k]);
					break;
				default:
					StopHier();
					break;
			}
		};

		if (kleur < LEDKleur::AllColours)
			schakelFunk(kleur, stand);
		else
		{
			for (auto i = 0; i < 4; i++)
				schakelFunk(static_cast<LEDKleur>(i), stand);
		}
	}
}

void STM32L432Nucleo32::blinkLED(const STM32L432Nucleo32::BlinkSetting stand) const
{
	assert(stand<BlinkSetting::Last);

	switch(stand)
	{
		case BlinkSetting::Stop:
		{
			BSP_LED_Off(LED_GREEN);
			HAL_LPTIM_Counter_Stop_IT(&hlptim1);
			HAL_NVIC_DisableIRQ(LPTIM1_IRQn);
		}
			break;

		case BlinkSetting::PermanentOn:
		{
			BSP_LED_On(LED_GREEN);
			HAL_LPTIM_Counter_Stop_IT(&hlptim1);
			HAL_NVIC_DisableIRQ(LPTIM1_IRQn);
		}
			break;

		default:
		{
			/* gebaseerd op LPTIM1 , welke gevoed wordt door de LSE met prescaler 2 */
			static const UInt16 knipperStanden[] =
					{
							0,
							0,
							65535,   /* 32767 / (2*65535) = 1/4 Hz */
							32767,   /* 32767 / (2*32767) = 1/2 Hz */
							16383,   /* 1 Hz */
							8191,    /* 2 Hz */
							4095     /* 6 Hz */
					};

			const auto periode = knipperStanden[static_cast<Teller>(stand)];
			const auto halvePeriode = periode>>1;
			if(HAL_OK != HAL_LPTIM_SetOnce_Start_IT(&hlptim1,periode,halvePeriode))
			{
				/* Initialization Error */
				StopHier();
			}
			else
			{
				HAL_NVIC_EnableIRQ(LPTIM1_IRQn);
			}
		}
	}
}


void STM32L432Nucleo32::waitFunction(const bool stopMode)
{
	/* stop de systick en andere timer interrupts , deze maakt anders de wfi ongedaan */
	HAL_NVIC_DisableIRQ(TIM1_BRK_TIM15_IRQn);
	NVIC_DisableIRQ(SysTick_IRQn);
	if (true == stopMode)
	{
		HAL_PWR_EnterSTOPMode(PWR_MAINREGULATOR_ON,PWR_STOPENTRY_WFI);

		/* STM32 gaat verder na knop interrupt */
		SYSCLKConfig_STOP(80);  /* breng PLL en HSE weer tot leven */
	}
	else  /* wacht op interrupt */
	{
		slaapMode();
	}
	HAL_NVIC_EnableIRQ(TIM1_BRK_TIM15_IRQn);
	NVIC_EnableIRQ(SysTick_IRQn);
}

TIM_HandleTypeDef STM32L432Nucleo32::Tim15Handle;

void STM32L432Nucleo32::waitFunction(const unsigned short msecs,
                                     const bool slaap) const
{
	__HAL_RCC_TIM15_CLK_ENABLE();
	Tim15Handle.Instance = TIM15;

	Tim15Handle.Init.Period        = 1000*msecs;
	Tim15Handle.Init.Prescaler     = 8000;  /* 80 Mhz --> 8000 */
	Tim15Handle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	Tim15Handle.Init.CounterMode   = TIM_COUNTERMODE_UP;
	if(HAL_TIM_Base_Init(&Tim15Handle) != HAL_OK)
	{
		/* Initialization Error */
		StopHier();
	}
	else
	{
		HAL_NVIC_SetPriority(TIM1_BRK_TIM15_IRQn, 14, 0);

		HAL_TIM_Base_Start_IT(&Tim15Handle);
		HAL_NVIC_EnableIRQ(TIM1_BRK_TIM15_IRQn);
	}
}

volatile bool STM32L432Nucleo32::timer2Afgelopen=false;

void STM32L432Nucleo32::timer2IsAfgelopen()
{
	timer2Afgelopen=true;
}

void STM32L432Nucleo32::slaapMode() const
{
	/* This option is used to ensure that store operations are completed */
#if defined ( __CC_ARM   )
	__force_stores();
#endif
	/* Request Wait For Interrupt */
	asm volatile ("wfi");
	//__WFI();
}

/**
 * @brief  Configures system clock after wake-up from STOP: enable HSE, PLL
 *         and select PLL as system clock source.
 * @param  None
 * @retval None
 */
void STM32L432Nucleo32::SYSCLKConfig_STOP(const UInt32 freq)
{
	assert(freq <= 100);

	/* 8 MHz klok in uit ST-Link, 96 MHz SysClk */
	RCC_OscInitTypeDef RCC_OscInitStruct;

	/**Configure the main internal regulator output voltage
	*/
	__HAL_RCC_PWR_CLK_ENABLE();

	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

