NielsU97/ECS/software/STM32/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32L4xx_Nucleo_32/STM32L4xxNucleo32.cpp
	/**Initializes the CPU, AHB and APB busses clocks
	*/
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_LSE
	                                   |RCC_OSCILLATORTYPE_MSI;
	RCC_OscInitStruct.LSEState = RCC_LSE_ON;
	RCC_OscInitStruct.LSIState = RCC_LSI_ON;
	RCC_OscInitStruct.MSIState = RCC_MSI_ON;
	RCC_OscInitStruct.MSICalibrationValue = 0;
	RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
	RCC_OscInitStruct.PLL.PLLM = 1;
	RCC_OscInitStruct.PLL.PLLN = 40;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
	RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
	RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;

	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
		StopHier();
	else
	{
		/**Initializes the CPU, AHB and APB busses clocks
		*/
		RCC_ClkInitTypeDef RCC_ClkInitStruct;
		RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
		                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
		RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
		RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
		RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
		RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

		if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
			StopHier();
		else
		{
			RCC_PeriphCLKInitTypeDef PeriphClkInit;

			PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC|RCC_PERIPHCLK_USART2
			                                     |RCC_PERIPHCLK_LPTIM1|RCC_PERIPHCLK_RNG
			                                     |RCC_PERIPHCLK_ADC;
			PeriphClkInit.Usart2ClockSelection = RCC_USART2CLKSOURCE_PCLK1;
			PeriphClkInit.Lptim1ClockSelection = RCC_LPTIM1CLKSOURCE_LSE;
			PeriphClkInit.AdcClockSelection = RCC_ADCCLKSOURCE_PLLSAI1;
			PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
			PeriphClkInit.RngClockSelection = RCC_RNGCLKSOURCE_PLLSAI1;
			PeriphClkInit.PLLSAI1.PLLSAI1Source = RCC_PLLSOURCE_MSI;
			PeriphClkInit.PLLSAI1.PLLSAI1M = 1;
			PeriphClkInit.PLLSAI1.PLLSAI1N = 16;
			PeriphClkInit.PLLSAI1.PLLSAI1P = RCC_PLLP_DIV7;
			PeriphClkInit.PLLSAI1.PLLSAI1Q = RCC_PLLQ_DIV2;
			PeriphClkInit.PLLSAI1.PLLSAI1R = RCC_PLLR_DIV2;
			PeriphClkInit.PLLSAI1.PLLSAI1ClockOut = RCC_PLLSAI1_48M2CLK|RCC_PLLSAI1_ADC1CLK;
			if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
				StopHier();
			else
			{
				HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSE, RCC_MCODIV_1);

				/**Enables the Clock Security System
				*/
				HAL_RCCEx_EnableLSECSS();

				/**Configure the main internal regulator output voltage
   */
				if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
				{
					StopHier();
				}
				else
				{
					/**Configure the Systick interrupt time
					*/
					HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000);

					/**Configure the Systick
					*/
					HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

					/** Enable MSI Auto calibration */
					HAL_RCCEx_EnableMSIPLLMode();

					/* SysTick_IRQn interrupt configuration */
					HAL_NVIC_SetPriority(SysTick_IRQn, 15, 0);
				}
			}
		}
	}
}

void STM32L432Nucleo32::initWatchDog(const UInt16 prescaler,
                                     const UInt16 venster)
{
	waakhond.Init.Prescaler = prescaler;
	waakhond.Init.Reload = venster;

	if (HAL_OK != HAL_IWDG_Init(&waakhond))
		StopHier();

}

void STM32L432Nucleo32::petTheWatchdog()
{
	HAL_IWDG_Refresh(&waakhond);
}

void STM32L432Nucleo32::coreReset() const
{
	NVIC_SystemReset();
}

UInt32 STM32L432Nucleo32::revEndianess(const UInt32 value) const
{
	UInt32 result;
	__ASM volatile ("rev %0, %1" : "=r" (result) : "r" (value) );
	return(result);
}

void  STM32L432Nucleo32::ledsInit()
{
	BSP_LED_Init(LED_GREEN);
	BSP_LED_Off(LED_GREEN);
}

void STM32L432Nucleo32::gpioInit()
{
	/* voorlopig niets */
}

void STM32L432Nucleo32::rngInit()
{
	/* Peripheral clock enable */
	__HAL_RCC_RNG_CLK_ENABLE();

	hrng.Instance = RNG;
	if (HAL_RNG_Init(&hrng) != HAL_OK)
		StopHier();
}

void STM32L432Nucleo32::rtcInit()
{
	__HAL_RCC_RTC_ENABLE();

	/**Initialize RTC Only
	 */
	hrtc.Instance = RTC;
	hrtc.Init.HourFormat = RTC_HOURFORMAT_24;
	hrtc.Init.AsynchPrediv = 127;
	hrtc.Init.SynchPrediv = 255;
	hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;
	hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
	hrtc.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;
	if (HAL_RTC_Init(&hrtc) != HAL_OK)
		StopHier();
}


void STM32L432Nucleo32::adcInit()
{
	__HAL_RCC_ADC_CLK_ENABLE();
	/**Common config */
	hadc1.Instance = ADC1;
	auto &init = hadc1.Init;
	init.ClockPrescaler = ADC_CLOCK_ASYNC_DIV1;
	init.Resolution = ADC_RESOLUTION_12B;
	init.DataAlign = ADC_DATAALIGN_RIGHT;
	init.ScanConvMode = ADC_SCAN_DISABLE;
	init.EOCSelection = ADC_EOC_SINGLE_CONV;
	init.LowPowerAutoWait = DISABLE;
	init.ContinuousConvMode = DISABLE;
	init.NbrOfConversion = 1;
	init.DiscontinuousConvMode = DISABLE;
	init.ExternalTrigConv = ADC_EXTERNALTRIG_T6_TRGO;
	init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
	init.DMAContinuousRequests = DISABLE;
	init.Overrun = ADC_OVR_DATA_PRESERVED;
	init.OversamplingMode = ENABLE;
	init.Oversampling.Ratio = ADC_OVERSAMPLING_RATIO_16;
	init.Oversampling.RightBitShift = ADC_RIGHTBITSHIFT_4;
	init.Oversampling.TriggeredMode = ADC_TRIGGEREDMODE_SINGLE_TRIGGER;
	init.Oversampling.OversamplingStopReset = ADC_REGOVERSAMPLING_CONTINUED_MODE;

	if (HAL_ADC_Init(&hadc1) != HAL_OK)
	{
		StopHier();
	}
	else
	{
		ADC_ChannelConfTypeDef sConfig;
		/**Configure Regular Channel
		*/
		sConfig.Channel = ADC_CHANNEL_8;
		sConfig.Rank = ADC_REGULAR_RANK_1;
		sConfig.SamplingTime = ADC_SAMPLETIME_247CYCLES_5;
		sConfig.SingleDiff = ADC_SINGLE_ENDED;
		sConfig.OffsetNumber = ADC_OFFSET_NONE;
		sConfig.Offset = 0;
		if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
		{
			StopHier();
		}
		else
		{
			__HAL_RCC_GPIOA_CLK_ENABLE();

			GPIO_InitTypeDef GPIO_InitStruct;

			/**ADC1 GPIO Configuration
			PA3     ------> ADC1_IN8
			*/
			GPIO_InitStruct.Pin = GPIO_PIN_3;
			GPIO_InitStruct.Mode = GPIO_MODE_ANALOG_ADC_CONTROL;
			GPIO_InitStruct.Pull = GPIO_NOPULL;
			HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

