NielsU97/ECS/software/STM32/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32L4xx_Nucleo_32/STM32L4xxNucleo32.cpp
			/* ADC1 interrupt Init */
			HAL_NVIC_SetPriority(ADC1_IRQn, 5, 0);
			HAL_NVIC_EnableIRQ(ADC1_IRQn);
		}
	}
}

void STM32L432Nucleo32::dacInit()
{
	__HAL_RCC_DAC1_CLK_ENABLE();
	/**DAC Initialization*/
	hdac1.Instance = DAC1;
	if (HAL_DAC_Init(&hdac1) != HAL_OK)
	{
		StopHier();
	}
	else
	{
		DAC_ChannelConfTypeDef sConfig;
		/**DAC channel OUT1 config*/
		sConfig.DAC_SampleAndHold = DAC_SAMPLEANDHOLD_DISABLE;
		sConfig.DAC_Trigger = DAC_TRIGGER_NONE;
		sConfig.DAC_OutputBuffer = DAC_OUTPUTBUFFER_ENABLE;
		sConfig.DAC_ConnectOnChipPeripheral = DAC_CHIPCONNECT_DISABLE;
		sConfig.DAC_UserTrimming = DAC_TRIMMING_FACTORY;
		if (HAL_DAC_ConfigChannel(&hdac1, &sConfig, DAC_CHANNEL_1) != HAL_OK)
		{
			StopHier();
		}
		else
		{
			__HAL_RCC_GPIOA_CLK_ENABLE();

			GPIO_InitTypeDef GPIO_InitStruct;

			/**DAC1 GPIO Configuration
			PA4     ------> DAC1_OUT1
			*/
			GPIO_InitStruct.Pin = GPIO_PIN_4;
			GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
			GPIO_InitStruct.Pull = GPIO_NOPULL;
			HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
		}
	}
}

void STM32L432Nucleo32::usart2Init()
{
	__HAL_RCC_USART2_CLK_ENABLE();
	huart2.Instance = USART2;

	auto &init = huart2.Init;
#ifdef STM32L432Nucleo32BaudRate
	/* ingesteld vanuit RGT.cmake
	 * win 10 machines op school werken standaard op 9600 en niet op 115200 !!! 115200; */
 	init.BaudRate = STM32L432Nucleo32BaudRate;
#else
	init.BaudRate = 115200;
#endif
	init.WordLength = UART_WORDLENGTH_8B;
	init.StopBits = UART_STOPBITS_1;
	init.Parity = UART_PARITY_NONE;
	init.Mode = UART_MODE_TX_RX;
	init.HwFlowCtl = UART_HWCONTROL_NONE;
	init.OverSampling = UART_OVERSAMPLING_16;
	init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
//	auto &advInit = huart2.AdvancedInit;
//	advInit.AdvFeatureInit = UART_ADVFEATURE_AUTOBAUDRATE_INIT;
//	advInit.AutoBaudRateEnable = UART_ADVFEATURE_AUTOBAUDRATE_ENABLE;
//	advInit.AutoBaudRateMode = UART_ADVFEATURE_AUTOBAUDRATE_ONSTARTBIT;
	if (HAL_UART_Init(&huart2) != HAL_OK)
	{
		StopHier();
	}
	else
	{
		__HAL_RCC_GPIOA_CLK_ENABLE();

		GPIO_InitTypeDef GPIO_InitStruct;
		/**USART2 GPIO Configuration
		 PA2     ------> USART2_TX
		 PA15 (JTDI)     ------> USART2_RX
		 */

		GPIO_InitStruct.Pin = VCP_TX_Pin;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
		HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

		GPIO_InitStruct.Pin = VCP_RX_Pin;
		GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull = GPIO_NOPULL;
		GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF3_USART2;
		HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

		__HAL_RCC_DMA1_CLK_ENABLE();
		/* USART2 DMA Init */
		/* USART2_RX Init */
		hdma_usart2_rx.Instance = DMA1_Channel6;
		auto &rxInit = hdma_usart2_rx.Init;
		rxInit.Request = DMA_REQUEST_2;
		rxInit.Direction = DMA_PERIPH_TO_MEMORY;
		rxInit.PeriphInc = DMA_PINC_DISABLE;
		rxInit.MemInc = DMA_MINC_ENABLE;
		rxInit.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
		rxInit.MemDataAlignment = DMA_MDATAALIGN_BYTE;
		rxInit.Mode = DMA_NORMAL;
		rxInit.Priority = DMA_PRIORITY_MEDIUM;
		if (HAL_DMA_Init(&hdma_usart2_rx) != HAL_OK)
		{
			StopHier();
		}
		else
		{
			__HAL_LINKDMA(&huart2, hdmarx, hdma_usart2_rx);

			/* USART2_TX Init */
			hdma_usart2_tx.Instance = DMA1_Channel7;
			auto &txInit = hdma_usart2_tx.Init;
			txInit.Request = DMA_REQUEST_2;
			txInit.Direction = DMA_MEMORY_TO_PERIPH;
			txInit.PeriphInc = DMA_PINC_DISABLE;
			txInit.MemInc = DMA_MINC_ENABLE;
			txInit.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
			txInit.MemDataAlignment = DMA_MDATAALIGN_BYTE;
			txInit.Mode = DMA_NORMAL;
			txInit.Priority = DMA_PRIORITY_LOW;
			if (HAL_DMA_Init(&hdma_usart2_tx) != HAL_OK)
			{
				StopHier();
			}
			else
			{
				__HAL_LINKDMA(&huart2, hdmatx, hdma_usart2_tx);

				HAL_NVIC_SetPriority(DMA1_Channel6_IRQn, 7, 0);
				HAL_NVIC_SetPriority(DMA1_Channel7_IRQn, 8, 0);

//				isrSem[static_cast<Teller>(Semafoor::Tx)] = CountingSemaphore(1,1);
//				isrSem[static_cast<Teller>(Semafoor::Tx)].Give(); /* hij staat klaar voor gebruik */
			}
		}
	}
}

void STM32L432Nucleo32::lptimInit()
{
	__HAL_RCC_LPTIM1_CLK_ENABLE();

	hlptim1.Instance = LPTIM1;
	auto &init = hlptim1.Init;
	
	init.Clock.Source = LPTIM_CLOCKSOURCE_APBCLOCK_LPOSC;
	init.Clock.Prescaler = LPTIM_PRESCALER_DIV2;
	init.Trigger.Source = LPTIM_TRIGSOURCE_SOFTWARE;
	init.OutputPolarity = LPTIM_OUTPUTPOLARITY_HIGH;
	init.UpdateMode = LPTIM_UPDATE_ENDOFPERIOD;
	init.CounterSource = LPTIM_COUNTERSOURCE_INTERNAL;
	init.Input1Source = LPTIM_INPUT1SOURCE_GPIO;
	init.Input2Source = LPTIM_INPUT2SOURCE_GPIO;
	if (HAL_LPTIM_Init(&hlptim1) != HAL_OK)
	{
		StopHier();
	}
}

void STM32L432Nucleo32::timInit()
{
	TIM_MasterConfigTypeDef sMasterConfig;

	__HAL_RCC_TIM6_CLK_ENABLE();

	htim6.Instance = TIM6;

	htim6.Init.Prescaler = 80;
	htim6.Init.CounterMode = TIM_COUNTERMODE_UP;
	htim6.Init.Period = 1000;
	htim6.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
	if (HAL_TIM_Base_Init(&htim6) != HAL_OK)
	{
		StopHier();
	}
	else
	{
		sMasterConfig.MasterOutputTrigger = TIM_TRGO_UPDATE;
		sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
		if (HAL_TIMEx_MasterConfigSynchronization(&htim6, &sMasterConfig) != HAL_OK)
		{
			StopHier();
		}
		else
		{
			__HAL_RCC_TIM7_CLK_ENABLE();
			htim7.Instance = TIM7;
			htim7.Init.Prescaler = 800;
			htim7.Init.CounterMode = TIM_COUNTERMODE_UP;
			htim7.Init.Period = 10000;
			htim7.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
			if (HAL_TIM_Base_Init(&htim7) != HAL_OK)
			{
				StopHier();
			}
			else
			{
				/*Configure the Tim7IRQ priority */
				HAL_NVIC_SetPriority(TIM1_TRG_COM_TIM17_IRQn, 12,0);

				sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
				sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
				if (HAL_TIMEx_MasterConfigSynchronization(&htim7, &sMasterConfig) != HAL_OK)
				{
					StopHier();
				}
				else
				{
					__HAL_RCC_TIM15_CLK_ENABLE();

