NielsU97/ECS/software/STM32/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32L4xx_Nucleo_32/STM32L4xxNucleo32.cpp
					htim15.Instance = TIM15;
					htim15.Init.Prescaler = 800;
					htim15.Init.CounterMode = TIM_COUNTERMODE_UP;
					htim15.Init.Period = 10000;
					htim15.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
					htim15.Init.RepetitionCounter = 0;
					htim15.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
					if (HAL_TIM_Base_Init(&htim15) != HAL_OK)
					{
						StopHier();
					}
					else
					{
						TIM_ClockConfigTypeDef sClockSourceConfig;
						sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
						if (HAL_TIM_ConfigClockSource(&htim15, &sClockSourceConfig) != HAL_OK)
						{
							StopHier();
						}
						else
						{
							sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
							sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
							if (HAL_TIMEx_MasterConfigSynchronization(&htim15, &sMasterConfig) != HAL_OK)
							{
								StopHier();
							}
							else
							{
								/*Configure the Tim7IRQ priority */
								HAL_NVIC_SetPriority(TIM1_BRK_TIM15_IRQn, 13,0);
							}
						}
					}
				}
			}
		}
	}
}


void STM32L432Nucleo32::send(const BoardUART eh,
                             const DataPakket<UInt8> &zendPakket)
{
	static const IRQn_Type uartDMAirqn[] = { DMA1_Channel7_IRQn , DMA1_Channel7_IRQn };

	/* neem de semafoor om toegang te krijgen tot de USART en de DMA */
	if (BoardUART::UART2 == eh)
	{

#ifndef FreeRTOSGebruikt
		while (false == isrSem[sem(Semafoor::Tx)]);
#else
		isrSem[sem(Semafoor::Tx)].Take();
#endif
	}
	else
	{
#ifndef FreeRTOSGebruikt
		while (false == isrSem[sem(Semafoor::Tx)]);
#else
		isrSem[sem(Semafoor::Tx)].Take();
#endif
	}
	const auto masterIndex = static_cast<Teller>(eh);
	/* IRQ wordt uitgezet in de ISR na verzending */
	NVIC_EnableIRQ(uartDMAirqn[masterIndex]);

	UART_HandleTypeDef * const huart = ((BoardUART::UART2 == eh) ? &huart2 : &huart2);
	auto * const tekens = zendPakket.geefPtr();
	const auto grootte = static_cast<UInt16>(zendPakket.geefGrootte());

	ONGEBRUIKT const HAL_StatusTypeDef status  = HAL_UART_Transmit_DMA(huart,tekens,grootte);
	assert(HAL_OK == status);
}

void STM32L432Nucleo32::receive(const BoardUART eh,
                                const DataPakket<UInt8> &ontvangPakket)
{
	assert(BoardUART::UART2==eh);


#ifndef FreeRTOSGebruikt
	isrSem[sem(Semafoor::Rx)]=false;
#endif

	auto * const huart = &huart2 ;

	/* Soms staat er nog data in het USART DR. lees deze data, anders pikt de DMA dit op. */
	LL_USART_ReceiveData8(huart->Instance);

	static const IRQn_Type uartDMAirqn[] = { DMA1_Channel6_IRQn , DMA1_Channel6_IRQn };

	const auto masterIndex = static_cast<Teller>(eh);
	NVIC_EnableIRQ(uartDMAirqn[masterIndex]);


	auto * const tekens = reinterpret_cast<UInt8 *>(&(ontvangPakket[0]));
	const auto grootte = static_cast<UInt16>(ontvangPakket.geefGrootte());

	ONGEBRUIKT const HAL_StatusTypeDef status = HAL_UART_Receive_DMA(huart,tekens,grootte);

	assert(HAL_OK == status);

#ifndef FreeRTOSGebruikt
		while (false == isrSem[sem(Semafoor::Rx)]);
#else
		const auto sw = sem(Semafoor::Rx);
		isrSem[sw].Take();
#endif

	NVIC_DisableIRQ(uartDMAirqn[masterIndex]);
}



FoutCode STM32L432Nucleo32::backupGeheugenOpslaan(const UInt16 adres, const UInt32 waarde)
{
	assert(adres<20);
	auto retkode = FoutCode::Onbekend;

	if (false == (adres<20))
		retkode = FoutCode::Fout;
	else
	{
		const auto hwAdres = (RTC_BKP_DR0 + adres);
		HAL_RTCEx_BKUPWrite(&hrtc, hwAdres, waarde);
		retkode = FoutCode::Ok;
	}
	return(retkode);
}

UInt32 STM32L432Nucleo32::backupGeheugenLezen(const UInt16 adres)
{
	assert(adres<20);

	UInt32 waarde = 0;

	if (true == (adres<20))
	{
		const auto hwAdres = (RTC_BKP_DR0 + adres);
		waarde = HAL_RTCEx_BKUPRead(&hrtc,hwAdres);
	}

	return(waarde);
}

TIM_HandleTypeDef STM32L432Nucleo32::Tim16Handle;

HAL_StatusTypeDef STM32L432Nucleo32::HAL_InitTick(uint32_t TickPriority)
{
	RCC_ClkInitTypeDef    clkconfig;
	uint32_t              uwTimclock = 0;
	uint32_t              uwPrescalerValue = 0;
	uint32_t              pFLatency;

	/* Enable Tim16 clock */
	__HAL_RCC_TIM16_CLK_ENABLE();

	/* Get clock configuration */
	HAL_RCC_GetClockConfig(&clkconfig, &pFLatency);

	/* Compute Tim16 clock */
	uwTimclock = 2*HAL_RCC_GetPCLK1Freq();

	/* Compute the prescaler value to have Tim16 counter clock equal to 1MHz */
	uwPrescalerValue = (uint32_t) ((uwTimclock / 1000000) - 1);

	/* Initialize Tim16 */
	Tim16Handle.Instance = TIM16;

	/* Initialize TIMx peripheral as follow:
	+ Period = [(Tim16CLK/1000) - 1]. to have a (1/1000) s time base.
	+ Prescaler = (uwTimclock/1000000 - 1) to have a 1MHz counter clock.
	+ ClockDivision = 0
	+ Counter direction = Up
	*/
	auto &handel = Tim16Handle.Init;
	handel.Period = (1000000 / 1000) - 1;
	handel.Prescaler = uwPrescalerValue;
	handel.ClockDivision = 0;
	handel.CounterMode = TIM_COUNTERMODE_UP;

	ONGEBRUIKT const auto status = HAL_TIM_Base_Init(&Tim16Handle);
	assert(HAL_OK == status);

	/*Configure the Tim16 IRQ priority */
	HAL_NVIC_SetPriority(TIM1_UP_TIM16_IRQn, TickPriority,0);
	/* Enable the Tim16 global Interrupt */
	HAL_NVIC_EnableIRQ(TIM1_UP_TIM16_IRQn);

	/* Start the TIM time Base generation in interrupt mode */
	return HAL_TIM_Base_Start_IT(&Tim16Handle);

}

/**
  * @brief  Suspend Tick increment.
  * @note   Disable the tick increment by disabling Tim16 update interrupt.
  * @param  None
  * @retval None
  */
void HAL_SuspendTick(void)
{
	/* Disable Tim16 update Interrupt */
	__HAL_TIM_DISABLE_IT(&STM32L432Nucleo32::Tim16Handle, TIM_IT_UPDATE);
}

/**
  * @brief  Resume Tick increment.
  * @note   Enable the tick increment by Enabling Tim16 update interrupt.
  * @param  None
  * @retval None
  */
void HAL_ResumeTick(void)
{
	/* Enable Tim16 Update interrupt */
	__HAL_TIM_ENABLE_IT(&STM32L432Nucleo32::Tim16Handle, TIM_IT_UPDATE);
}

#ifdef FreeRTOSGebruikt

void STM32L432Nucleo32::isrSemafoorAfhandeling(CountingSemaphore &sem)
{
	BaseType_t nieuwePrio;
	const bool wakkerGeworden = sem.GiveFromISR(&nieuwePrio);
	if (true == wakkerGeworden)
		portYIELD_FROM_ISR(nieuwePrio);
}

CountingSemaphore STM32L432Nucleo32::isrSem[AantalSems] = { CountingSemaphore(1,0),
															CountingSemaphore(1,1),
															CountingSemaphore(1,0) };
#else
bool STM32L432Nucleo32::isrSem[AantalSems] = { false,true,false };
#endif

