NielsU97/ECS/software/STM32/STM32Basis/HAL/gemeenschappelijk/Libraries/BSP/STM32L4xx_Nucleo_32/STM32L4xxNucleo32.cpp
DMA_HandleTypeDef STM32L432Nucleo32::hdma_usart2_tx;
DMA_HandleTypeDef STM32L432Nucleo32::hdma_usart2_rx;
UART_HandleTypeDef STM32L432Nucleo32::huart2;
ADC_HandleTypeDef STM32L432Nucleo32::hadc1;
LPTIM_HandleTypeDef STM32L432Nucleo32::hlptim1;

const GPIO_TypeDef * STM32L432Nucleo32::MCO_GPIO_Port = GPIOA;
const GPIO_TypeDef * STM32L432Nucleo32::VCP_TX_GPIO_Port= GPIOA;
const GPIO_TypeDef * STM32L432Nucleo32::SWDIO_GPIO_Port= GPIOA;
const GPIO_TypeDef * STM32L432Nucleo32::SWCLK_GPIO_Port= GPIOA;
const GPIO_TypeDef * STM32L432Nucleo32::VCP_RX_GPIO_Port= GPIOA;
const GPIO_TypeDef * STM32L432Nucleo32::LD3_GPIO_Port= GPIOB;




/* C++ name mangling mag niet de interrupt handler namen veranderen, 
 * deze staan in een assembly bestand zo genoemd.
 * Derhalve hieronder met C-Linking compileren.
 */
#ifdef __cplusplus
extern "C" {
#endif
/******************************************************************************
  Cortex-M3 Processor Exceptions Handlers
******************************************************************************/

// ----------------------------------------------------------------------------
// This function handles NMI exception.
// ----------------------------------------------------------------------------
void NMI_Handler(void)
{
	while(1){;}
}

// ----------------------------------------------------------------------------
// This function handles Hard Fault exception.
// ----------------------------------------------------------------------------
void HardFault_Handler(void)
{
	// Go to infinite loop when Hard Fault exception occurs
	while(1){;}
}

// ----------------------------------------------------------------------------
// This function handles Memory Manage exception.
// ----------------------------------------------------------------------------
void MemManage_Handler(void)
{
	// Go to infinite loop when Memory Manage exception occurs
	while(1){;}
}

// ----------------------------------------------------------------------------
// This function handles Bus Fault exception.
// ----------------------------------------------------------------------------
void BusFault_Handler(void)
{
	// Go to infinite loop when Bus Fault exception occurs
	while(1){;}
}

// ----------------------------------------------------------------------------
// This function handles Usage Fault exception.
// ----------------------------------------------------------------------------
void UsageFault_Handler(void)
{
	// Go to infinite loop when Usage Fault exception occurs
	while(1){;}
}

// ----------------------------------------------------------------------------
// This function handles SVCall exception.
// ----------------------------------------------------------------------------
ZWAKGEPLAATST void SVC_Handler(void)
{
}

// ----------------------------------------------------------------------------
// This function handles Debug Monitor exception.
// ----------------------------------------------------------------------------
void DebugMon_Handler(void)
{
}

// ----------------------------------------------------------------------------
// This function handles PendSV_Handler exception.
// ----------------------------------------------------------------------------
ZWAKGEPLAATST void PendSV_Handler(void)
{
}

/**
  * @brief  This function handles SysTick Handler.
  * @param  None
  * @retval None
  */
ZWAKGEPLAATST void SysTick_Handler(void)
{
	HAL_SYSTICK_IRQHandler();
}


void TIM1_BRK_TIM15_IRQHandler(void)
{
	/* wacht timer */
	HAL_TIM_IRQHandler(&(STM32L432Nucleo32::Tim15Handle));

	STM32L432Nucleo32::timer2IsAfgelopen();
}

void TIM7_IRQHandler(void)
{
	/* blauwe led knipper */
	HAL_TIM_IRQHandler(&(STM32L432Nucleo32::Tim7Handle));
	BSP_LED_Toggle(LED_GREEN);
}



void TIM1_UP_TIM16_IRQHandler(void)
{
	/**
     * @brief  Deze funktie wordt gebruikt voor de HAL Tick funktie.
     */

	HAL_TIM_IRQHandler(&(STM32L432Nucleo32::Tim16Handle));
	HAL_IncTick();

}


/**
  * @brief This function handles LPTIM1 global interrupt.
  */
void LPTIM1_IRQHandler(void)
{
	HAL_LPTIM_IRQHandler(&(STM32L432Nucleo32::hlptim1));
	BSP_LED_Toggle(LED_GREEN);	
}

void USART2_IRQHandler()
{
	const bool rxInterrupt = (HAL_UART_STATE_BUSY_RX  == STM32L432Nucleo32::huart2.RxState);
	const bool txInterrupt = (HAL_UART_STATE_BUSY_TX  == STM32L432Nucleo32::huart2.gState);

	HAL_UART_IRQHandler(&(STM32L432Nucleo32::huart2));

	if (true == rxInterrupt)
	{
		const bool rxEindeInterrupt = (HAL_UART_STATE_READY  == STM32L432Nucleo32::huart2.RxState);
		if (true == rxEindeInterrupt)
		{
			static constexpr auto index = STM32L432Nucleo32::sem(STM32L432Nucleo32::Semafoor::Rx);
#ifndef FreeRTOSGebruikt
			STM32L432Nucleo32::isrSem[index] = true;
#else
			auto &sem = STM32L432Nucleo32::isrSem[index];
			STM32L432Nucleo32::isrSemafoorAfhandeling(sem);
#endif
		}
	}
	else if (true == txInterrupt)
	{
		const bool txEindeInterrupt = (HAL_UART_STATE_READY  == STM32L432Nucleo32::huart2.gState);
		if (true == txEindeInterrupt)
		{
			static constexpr auto index = STM32L432Nucleo32::sem(STM32L432Nucleo32::Semafoor::Tx);
#ifndef FreeRTOSGebruikt

			STM32L432Nucleo32::isrSem[index] = true;
#else
			auto &sem = STM32L432Nucleo32::isrSem[index];
			STM32L432Nucleo32::isrSemafoorAfhandeling(sem);
#endif
		}
	}
}
/**
* @brief This function handles DMA1 Channel 6 global interrupt.
*/
void DMA1_Channel6_IRQHandler(void)
{
	HAL_UART_IRQHandler(&(STM32L432Nucleo32::huart2));
	HAL_DMA_IRQHandler(&STM32L432Nucleo32::hdma_usart2_rx);

	if(HAL_DMA_STATE_READY == STM32L432Nucleo32::hdma_usart2_rx.State)
	{
		static constexpr auto index = STM32L432Nucleo32::sem(STM32L432Nucleo32::Semafoor::Rx);
		STM32L432Nucleo32::huart2.gState = HAL_UART_STATE_READY; /* fix want hal bibliotheek doet dit niet ..... */
#ifndef FreeRTOSGebruikt
		STM32L432Nucleo32::isrSem[index] = true;
#else
		auto &sem = STM32L432Nucleo32::isrSem[index];
		STM32L432Nucleo32::isrSemafoorAfhandeling(sem);
#endif
	}
}

/**
* @brief This function handles DMA1 Channel 7 global interrupt.
*/
void DMA1_Channel7_IRQHandler(void)
{
	HAL_DMA_IRQHandler(&STM32L432Nucleo32::hdma_usart2_tx);

	if(HAL_DMA_STATE_READY == STM32L432Nucleo32::hdma_usart2_tx.State)
	{
		NVIC_DisableIRQ(DMA1_Channel7_IRQn); /* zet uit */

		static constexpr auto index = STM32L432Nucleo32::sem(STM32L432Nucleo32::Semafoor::Tx);
		STM32L432Nucleo32::huart2.gState = HAL_UART_STATE_READY; /* fix want hal bibliotheek doet dit niet ..... */
#ifndef FreeRTOSGebruikt
		STM32L432Nucleo32::isrSem[index] = true;
#else
		auto &sem = STM32L432Nucleo32::isrSem[index];
		STM32L432Nucleo32::isrSemafoorAfhandeling(sem);
#endif

	}
}


#ifdef __cplusplus
}
#endif

#ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
extern "C" void assert_failed(char *file, uint32_t line)
{
	/* User can add his own implementation to report the file name and line number,
	   ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

	StopHier();

}



#endif

